---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarGeometryType.ShapeBased
enum: Autodesk.Revit.DB.Structure.RebarGeometryType
source: html/7af9014f-a806-b38e-b588-1595d2016d8d.htm
---
# Autodesk.Revit.DB.Structure.RebarGeometryType.ShapeBased

Shape Driven.